## Staging: cognito
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 13 to add, 1 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cognito_lambda_kms will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cognito_lambda_kms" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.cognito_lambda_secrets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cognito_lambda_secrets" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                         = "ca-central-1_Cguq9JNQ1"
        name                       = "forms_user_pool"
        tags                       = {}
        # (12 unchanged attributes hidden)

      + lambda_config {
          + custom_email_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }

          + custom_sms_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }
        }

      ~ password_policy {
          - temporary_password_validity_days = 7 -> null
            # (5 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_iam_policy.cognito_lambda_kms will be created
  + resource "aws_iam_policy" "cognito_lambda_kms" {
      + arn         = (known after apply)
      + description = "IAM policy for storing encrypting and decrypting data"
      + id          = (known after apply)
      + name        = "cognito_lambda_kms"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.cognito_lambda_logging will be created
  + resource "aws_iam_policy" "cognito_lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a cognito lambda"
      + id          = (known after apply)
      + name        = "cognito_lambda_logging"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.cognito_lambda_secrets will be created
  + resource "aws_iam_policy" "cognito_lambda_secrets" {
      + arn         = (known after apply)
      + description = "IAM policy for accessing secret manager"
      + id          = (known after apply)
      + name        = "cognito_lambda_secrets"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.cognito_lambda will be created
  + resource "aws_iam_role" "cognito_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_cognito_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cognito_lambda_kms will be created
  + resource "aws_iam_role_policy_attachment" "cognito_lambda_kms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_cognito_lambda"
    }

  # aws_iam_role_policy_attachment.cognito_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "cognito_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_cognito_lambda"
    }

  # aws_iam_role_policy_attachment.cognito_lambda_secrets will be created
  + resource "aws_iam_role_policy_attachment" "cognito_lambda_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_cognito_lambda"
    }

  # aws_kms_alias.cognito_encryption_alias will be created
  + resource "aws_kms_alias" "cognito_encryption_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cognito-encryption-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.cognito_encryption will be created
  + resource "aws_kms_key" "cognito_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Key used by AWS Cognito to encrypt data sent to lambda triggers"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::687401027353:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = "kms:CreateGrant"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cognito-idp.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable Cognito Access to KMS key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_lambda_function.cognito_email_sender will be created
  + resource "aws_lambda_function" "cognito_email_sender" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cognito_email_sender_main.zip"
      + function_name                  = "Cognito_Email_Sender"
      + handler                        = "cognito_email_sender.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "0dzEPBfnzg/PIrcBQ6BlSVP5cf3JcppZJ0p8pU/G+ws="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs will be created
  + resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/cognito_email_sender_nodejs.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "cognito_email_sender_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "hv8uy88kZ4rnsXlMUC0KjyUVVyBYafyrl8949sNwz08="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_secretsmanager_secret.cognito_notify_api_key will be created
  + resource "aws_secretsmanager_secret" "cognito_notify_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "cognito_notify_api_key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.cognito_notify_api_key will be created
  + resource "aws_secretsmanager_secret_version" "cognito_notify_api_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 13 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + cognito_user_pool_id = "ca-central-1_Cguq9JNQ1"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
